Repository: webcava/suggester
Catalog: languages/suggester-*.po
Languages: ar

source: Dashboard
ar: لوحة التحكم

source: Tools
ar: الأدوات

source: Settings
ar: الإعدادات

source: Help
ar: المساعدة

source: Overview
ar: نظرة عامة

source: Statistics
ar: الإحصائيات

source: Suggestion History
ar: تاريخ الاقتراحات

source: Our Other Tools
ar: أدواتنا الأخرى

source: Suggester Dashboard
ar: لوحة تحكم Suggester

source: Create New Tool
ar: إنشاء أداة جديدة

source: Edit Tool
ar: تعديل الأداة

source: Maximum tool limit reached.
ar: تم الوصول إلى الحد الأقصى للأدوات.

source: Tool Name
ar: اسم الأداة

source: Shortcode
ar: الكود المختصر

source: Status
ar: الحالة

source: Actions
ar: الإجراءات

source: No tools found. Create your first tool to get started.
ar: لم يتم العثور على أدوات. أنشئ أداتك الأولى للبدء.

source: Shortcode:
ar: الكود المختصر:

source: Back to Tools
ar: العودة إلى الأدوات

source: Save Changes
ar: حفظ التغييرات

source: Save Settings
ar: حفظ الإعدادات

source: Basic Settings
ar: الإعدادات الأساسية

source: Enter a name to identify this suggestion tool in the admin panel.
ar: أدخل اسماً لتحديد أداة الاقتراحات هذه في لوحة الإدارة.

source: Custom API Keys
ar: مفاتيح API مخصصة

source: Use custom API keys for this tool
ar: استخدم مفاتيح API مخصصة لهذه الأداة

source: Enable to use specific API keys for this tool instead of global settings.
ar: فعّل لاستخدام مفاتيح API محددة لهذه الأداة بدلاً من الإعدادات العامة.

source: This tool is using global API keys from the Settings page.
ar: تستخدم هذه الأداة مفاتيح API العامة من صفحة الإعدادات.

source: Manage Global Keys
ar: إدارة المفاتيح العامة

source: Google Gemini API Key
ar: مفتاح Google Gemini API

source: Enter your Google Gemini API key. Get one at https://ai.google.dev/
ar: أدخل مفتاح Google Gemini API الخاص بك. احصل على واحد من https://ai.google.dev/

source: Leave this field empty to disable this key.
ar: اترك هذا الحقل فارغاً لتعطيل هذا المفتاح.

source: Leave this field empty to disable this key globally.
ar: اترك هذا الحقل فارغاً لتعطيل هذا المفتاح عالمياً.

source: OpenRouter API Key 1
ar: مفتاح OpenRouter API الأول

source: OpenRouter API Key 2
ar: مفتاح OpenRouter API الثاني

source: Select Model
ar: اختر النموذج

source: Enter your OpenRouter API key and select a model. Get a key at https://openrouter.ai
ar: أدخل مفتاح OpenRouter API واختر نموذجاً. احصل على مفتاح من https://openrouter.ai

source: Enter your second OpenRouter API key and select a model. Multiple keys enable intelligent load balancing.
ar: أدخل مفتاح OpenRouter API الثاني واختر نموذجاً. المفاتيح المتعددة تمكّن توزيع الأحمال الذكي.

source: Prompt Template
ar: قالب الطلب

source: Enter the prompt template for generating suggestions. Use the following variables:
ar: أدخل قالب الطلب لإنتاج الاقتراحات. استخدم المتغيرات التالية:

source: The keyword entered by the user
ar: الكلمة المفتاحية التي أدخلها المستخدم

source: Number of suggestions to generate (default: 3)
ar: عدد الاقتراحات المراد إنتاجها (افتراضي: 3)

source: Language for suggestions (default: English)
ar: لغة الاقتراحات (افتراضي: الإنجليزية)

source: Default Suggestion Count
ar: عدد الاقتراحات الافتراضي

source: Default number of suggestions to generate (1-10)
ar: العدد الافتراضي للاقتراحات المراد إنتاجها (1-10)

source: Templates
ar: القوالب

source: Selected
ar: محدد

source: Select
ar: اختر

source: Customization
ar: التخصيص

source: Favorites Menu
ar: قائمة المفضلة

source: Show or hide the favorites section in the frontend.
ar: عرض أو إخفاء قسم المفضلة في الواجهة الأمامية.

source: Accent Color
ar: اللون المميز

source: Choose the accent color for buttons and highlights.
ar: اختر اللون المميز للأزرار والتمييزات.

source: Button Text Color
ar: لون نص الزر

source: Choose the text color for buttons.
ar: اختر لون النص للأزرار.

source: API Key Settings
ar: إعدادات مفاتيح API

source: Configure global API keys that will be used by default for all tools. Tools can override these settings by enabling "Custom API Keys" in their individual settings.
ar: قم بتكوين مفاتيح API العامة التي ستُستخدم افتراضياً لجميع الأدوات. يمكن للأدوات تجاوز هذه الإعدادات عن طريق تفعيل "مفاتيح API مخصصة" في إعداداتها الفردية.

source: How Key Rotation Works
ar: كيف يعمل تدوير المفاتيح

source: Understanding the intelligent key rotation system and its benefits.
ar: فهم نظام تدوير المفاتيح الذكي وفوائده.

source: What is Key Rotation?
ar: ما هو تدوير المفاتيح؟

source: When users generate suggestions, the plugin automatically switches between your API keys. This prevents overusing any single key and helps avoid rate limits.
ar: عندما ينتج المستخدمون الاقتراحات، يتبديل البرنامج تلقائياً بين مفاتيح API الخاصة بك. هذا يمنع الإفراط في استخدام أي مفتاح واحد ويساعد في تجنب حدود المعدل.

source: Works with One Key Too
ar: يعمل مع مفتاح واحد أيضاً

source: You can use just one API key and the plugin will work perfectly. Adding more keys simply provides better performance and reliability.
ar: يمكنك استخدام مفتاح API واحد فقط وسيعمل البرنامج بشكل مثالي. إضافة مفاتيح أكثر يوفر فقط أداءً وموثوقية أفضل.

source: Why Use Multiple Keys?
ar: لماذا نستخدم مفاتيح متعددة؟

source: Multiple keys reduce the load on each individual key. This is especially helpful if you expect high traffic or many suggestion requests.
ar: المفاتيح المتعددة تقلل الحمل على كل مفتاح فردي. هذا مفيد بشكل خاص إذا كنت تتوقع حركة مرور عالية أو طلبات اقتراحات كثيرة.

source: Global vs Tool-Specific Keys
ar: المفاتيح العامة مقابل مفاتيح الأدوات المحددة

source: Keys configured here are used by all tools by default. For high-traffic tools, you can assign dedicated keys in each tool's individual settings for better performance.
ar: المفاتيح المكوّنة هنا تُستخدم من قبل جميع الأدوات افتراضياً. للأدوات ذات الحركة العالية، يمكنك تخصيص مفاتيح مخصصة في إعدادات كل أداة على حدة لأداء أفضل.

source: Recommendation
ar: التوصية

source: Start with at least one key to get up and running
ar: ابدأ بمفتاح واحد على الأقل للبدء والتشغيل

source: Add 2-3 keys for better performance and reliability
ar: أضف 2-3 مفاتيح لأداء وموثوقية أفضل

source: Use tool-specific keys only for high-traffic tools
ar: استخدم المفاتيح المخصصة للأدوات فقط للأدوات ذات الحركة العالية

source: Monitor the tracking statistics to see how your keys are performing
ar: راقب إحصائيات التتبع لمعرفة كيف تؤدي مفاتيحك

source: API Keys
ar: مفاتيح API

source: The Suggester plugin relies on API keys from Google Gemini and OpenRouter to generate intelligent content suggestions. These APIs provide the AI-powered functionality that makes the plugin work.
ar: يعتمد مكون Suggester على مفاتيح API من Google Gemini و OpenRouter لإنتاج اقتراحات المحتوى الذكية. هذه الـ APIs توفر الوظائف المدعومة بالذكاء الاصطناعي التي تجعل البرنامج يعمل.

source: Google Gemini is a powerful AI model that provides fast and accurate content suggestions.
ar: Google Gemini هو نموذج ذكاء اصطناعي قوي يوفر اقتراحات محتوى سريعة ودقيقة.

source: How to get your Google Gemini API Key:
ar: كيفية الحصول على مفتاح Google Gemini API:

source: Visit the Google AI Studio at
ar: زر Google AI Studio على

source: Sign in with your Google account
ar: سجل الدخول بحساب Google الخاص بك

source: Click on "Get API Key" in the top navigation
ar: انقر على "الحصول على مفتاح API" في التنقل العلوي

source: Create a new API key or use an existing one
ar: أنشئ مفتاح API جديد أو استخدم مفتاحاً موجوداً

source: Copy the API key and paste it into the Settings page
ar: انسخ مفتاح API والصقه في صفحة الإعدادات

source: The free tier includes generous usage limits for most websites
ar: الطبقة المجانية تتضمن حدود استخدام سخية لمعظم المواقع

source: New Tools on the Way!
ar: أدوات جديدة في الطريق!

source: We're currently developing an innovative set of tools that will take your experience with us to a whole new level. Stay tuned for updates soon!
ar: نحن نطور حالياً مجموعة مبتكرة من الأدوات التي ستأخذ تجربتك معنا إلى مستوى جديد تماماً. ترقب التحديثات قريباً!

source: Get in Touch
ar: تواصل معنا

source: Have an idea for a tool, a comment, or would you like to develop a custom tool that fits your needs? We'd love to hear from you—contact us at
ar: لديك فكرة لأداة، تعليق، أو تود تطوير أداة مخصصة تناسب احتياجاتك؟ نحب أن نسمع منك—تواصل معنا على

source: What to Expect
ar: ما تتوقعه

source: Advanced Analytics
ar: تحليلات متقدمة

source: Deeper insights into your content performance and user engagement.
ar: رؤى أعمق حول أداء المحتوى ومشاركة المستخدمين.

source: Custom Templates
ar: قوالب مخصصة

source: Create and save your own suggestion templates for consistent results.
ar: أنشئ واحفظ قوالب الاقتراحات الخاصة بك للحصول على نتائج متسقة.

source: Team Collaboration
ar: تعاون الفريق

source: Share tools and insights with your team members seamlessly.
ar: شارك الأدوات والرؤى مع أعضاء فريقك بسلاسة.

source: API Integrations
ar: تكاملات API

source: Connect with your favorite tools and platforms automatically.
ar: اتصل مع أدواتك ومنصاتك المفضلة تلقائياً.

source: Stay Updated
ar: ابق محدثاً

source: Want to be the first to know about new tools and features? Follow our updates and announcements.
ar: تريد أن تكون أول من يعرف عن الأدوات والميزات الجديدة؟ تابع تحديثاتنا وإعلاناتنا.

source: Subscribe to Updates
ar: اشترك في التحديثات

source: Suggestion History — available in the premium version.
ar: تاريخ الاقتراحات — متاح في النسخة المميزة.

source: Keep track of all the keywords you've used, the tool's suggestions, and which suggestions users liked—all in one place. Upgrade to the premium version to unlock this feature.
ar: تتبع جميع الكلمات المفتاحية التي استخدمتها، واقتراحات الأداة، والاقتراحات التي أعجب بها المستخدمون—كل ذلك في مكان واحد. ترقى إلى النسخة المميزة لفتح هذه الميزة.

source: Date
ar: التاريخ

source: Transaction ID
ar: معرف المعاملة

source: Keyword
ar: الكلمة المفتاحية

source: Tool
ar: الأداة

source: Favorite Suggestions
ar: الاقتراحات المفضلة

source: Suggestion history cannot be displayed in the free version.
ar: لا يمكن عرض تاريخ الاقتراحات في النسخة المجانية.

source: Unlock favorites, keyword history, and more with the premium upgrade.
ar: فتح المفضلة، تاريخ الكلمات المفتاحية، والمزيد مع الترقية المميزة.

source: Complete suggestion history tracking
ar: تتبع كامل لتاريخ الاقتراحات

source: Keyword analytics and insights
ar: تحليلات ورؤى الكلمات المفتاحية

source: Favorite suggestions tracking
ar: تتبع الاقتراحات المفضلة

source: Export data to CSV
ar: تصدير البيانات إلى CSV

source: Upgrade to Premium
ar: ترقى إلى المميز

source: Suggest
ar: اقترح

source: Suggestions you liked
ar: الاقتراحات التي أعجبتك

source: No saved suggestions yet.
ar: لا توجد اقتراحات محفوظة بعد.

source: Copy to clipboard
ar: نسخ إلى الحافظة

source: You're using the free version.
ar: أنت تستخدم النسخة المجانية.

source: Facing issues or have a suggestion? Contact us at:
ar: تواجه مشاكل أو لديك اقتراح؟ تواصل معنا على:

source: Invalid suggestion tool ID.
ar: معرف أداة الاقتراح غير صالح.

source: Suggestion tool not found.
ar: أداة الاقتراح غير موجودة.

source: This suggestion tool is currently disabled.
ar: أداة الاقتراح هذه معطلة حالياً.

source: Last used
ar: آخر استخدام

source: Error:
ar: خطأ:

source: Tracking:
ar: التتبع:

source: Reset tracking statistics
ar: إعادة تعيين إحصائيات التتبع

source: Copy
ar: نسخ

source: Are you sure you want to delete this tool? This action cannot be undone.
ar: هل أنت متأكد من حذف هذه الأداة؟ لا يمكن التراجع عن هذا الإجراء.

source: Are you sure you want to reset the tracking statistics for this API key? This action cannot be undone.
ar: هل أنت متأكد من إعادة تعيين إحصائيات التتبع لمفتاح API هذا؟ لا يمكن التراجع عن هذا الإجراء.

source: Tool duplicated successfully
ar: تم تكرار الأداة بنجاح

source: Describe what you want here...
ar: اكتب ما تريده هنا...

source: Save to favorites
ar: حفظ في المفضلة

source: Remove from favorites
ar: حذف من المفضلة
